/*--------------------------------------------------------------------------------   
 * 项目名称:

     RGB流水灯板延时子函数

 * 功能描述:

     1、毫秒级延时
	 2、100毫秒级延时

 * 版权信息:

     (c) 飞翼电子, 2014.

 * 历史版本:
     2014-03-15:
       - 初始版本 V1.0.0;

 * 配置说明:
     MCU:             STC15W204S
     晶振:      	  内部晶振：33MHz
     扩展模块:  	  -
     软件:            Keil.C51.V9.01

 * 备注:

--------------------------------------------------------------------------------*/   

#include "Delay.h"

//-------------------------------------------------------------------------------
//子程序名称:void DelayMs(unsigned char m)
//功能：延时子函数.
//-------------------------------------------------------------------------------
void DelayMs(unsigned char m)
{
	unsigned char i,j,k;
	for(k=0;k<m;k++)
	{
		for(i=0;i<60;i++)
		{
			for(j=0;j<78;j++)
			{
				;
			}
		}
	}
}
//-------------------------------------------------------------------------------
//子程序名称:void DelayMs(unsigned char m)
//功能：延时100ms子函数（晶振频率33MHz时）
//-------------------------------------------------------------------------------
void Delay100Ms(unsigned char m)
{
	unsigned char i,j,k,l;
	for(l=0;l<m;l++)
	{
		for(k=0;k<98;k++)
		{
			for(i=0;i<60;i++)
			{
				for(j=0;j<78;j++)
				{
					;
				}
			}
		}
	}
}