/*------------------------------------------------------------------------------------
 * 项目名称:

     RGB LED 测试程序

 * 功能描述:

	 单个红色LED旋转效果

 * 版权信息:

     (c) 飞翼电子, 2014.

 * 历史版本:
     2014-03-7:
       - 初始版本 V1.0.0;

 * 配置说明:
 	 - MCU    ：STC15W204S
	 - CPU频率：33MHz
-------------------------------------------------------------------------------------*/

#define Port P3
#define GREEN 0
#define RED 1
#define BLUE 2

/************************包含头文件***************************************************/

#include "STC15W.h"
#include "ws2812.h"
#include "delay.h"
#include "keypad.h"

/************************主程序*******************************************************/

void  main()
{
	unsigned char i;
	unsigned char s[8][3]={{50,5,5},{50,5,5},{50,5,5},{50,5,5},{50,5,5},{50,5,5},
	{50,5,5},{50,5,5}};//定义一个二维数组，每个括号内的三个数据对应一个像素点{G,R,B}

	DelayMs(200);				//上电等待延时

	Port=0xff;					//初始化端口为高电平

	while(1)
	{
		for(i=0;i<8;i++)		
		{
			s[i][0]=5;			//修改数组中的数据
			s[i][1]=50;
			s[i][2]=5;


			SendOneFrame(s);	//显示数组中的数据
			Delay100Ms(1);

			s[i][0]=50;
			s[i][1]=5;
			s[i][2]=5;

		}
	}
}




/************************结束*******************************************************/
