/*------------------------------------------------------------------------------------
 * 项目名称:

     RGB LED 测试程序

 * 功能描述:

	 RGB三色旋转效果1

 * 版权信息:

     (c) 飞翼电子, 2014.

 * 历史版本:
     2014-03-7:
       - 初始版本 V1.0.0;

 * 配置说明:
 	 - MCU    ：STC15F204S
	 - CPU频率：33MHz
-------------------------------------------------------------------------------------*/

#define Port P3
#define GREEN 0
#define RED 1
#define BLUE 2

/************************包含头文件***************************************************/

#include "STC15W.h"
#include "ws2812.h"
#include "delay.h"
#include "keypad.h"

/************************主程序*******************************************************/

void  main()
{
	unsigned char i;
	unsigned char s[8][3]={{50,5,5},{50,5,5},{50,5,5},{5,50,5},{5,50,5},{5,5,50},{5,5,50},{5,5,50},};
		//定义一个二维，每个括号内的三个数据对应一个像素点{G,R,B}

	DelayMs(200);					//上电等待延时

	Port=0xff;						//初始化端口为高电平

	while(1)
	{

		for(i=0;i<8;)
		{					
			SendOneFrameFrom(i,s);	//从低i个像素点显示数组的数据
			Delay100Ms(10);
			i+=1;
		}
	}
}




/************************结束*******************************************************/
